InformationRegisters/ПЛ_ДополнительныеКонстанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_ДополнительныеКонстанты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПЛ_ДополнительныеКонстантыПовтИсп/Ext/Module.bsl
//<< Портал-Юг, Бердов В.В., 2020.06.17 [Интеграция с Elma] 
Функция ВернутьДополнительнуюКонстанту(Знач ИмяДополнительногоПараметра, НесколькоПараметров = Ложь) Экспорт
	
	ЕстьПривилегированныйРежим = ПривилегированныйРежим();
	Если НЕ ЕстьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	Если НесколькоПараметров И ТипЗнч(ИмяДополнительногоПараметра) = Тип("Строка") Тогда
		НовыйМассив = СтрРазделить(ИмяДополнительногоПараметра, "|", Ложь);
		Если НовыйМассив.Количество() > 1 Тогда
			ИмяДополнительногоПараметра = НовыйМассив;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоМассивПараметров = (ТипЗнч(ИмяДополнительногоПараметра) = Тип("Массив"));
	Результат = ?(ЭтоМассивПараметров, Новый Структура, Неопределено);
	Если ЭтоМассивПараметров Тогда
		Для Индекс = 0 по ИмяДополнительногоПараметра.ВГраница() Цикл
			Результат.Вставить(ИмяДополнительногоПараметра[Индекс]);
		КонецЦикла; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПЛ_ДополнительныеКонстанты.Имя КАК Имя,
	|	ПЛ_ДополнительныеКонстанты.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ПЛ_ДополнительныеКонстанты КАК ПЛ_ДополнительныеКонстанты
	|ГДЕ
	|	ПЛ_ДополнительныеКонстанты.Имя В (&Имя)";
	
	Запрос.УстановитьПараметр("Имя", ИмяДополнительногоПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЭтоМассивПараметров Тогда
			Результат[Выборка.Имя] = Выборка.Значение;
		Иначе	
			Результат = Выборка.Значение;
		КонецЕсли; 
	КонецЦикла;
	
	Если НЕ ЕстьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Возврат ?(ЭтоМассивПараметров, Новый ФиксированнаяСтруктура(Результат), Результат);
	
КонецФункции //>>
